---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.GetEnumerator
source: html/9547c9ff-e9a3-3071-23ab-2f3604cca082.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.